results/results/raw/interzone/calico-interzone-apachebench_100K_250_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.6 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.6
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      250
Time taken for tests:   5.988 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      85400000 bytes
HTML transferred:       61200000 bytes
Requests per second:    16699.20 [#/sec] (mean)
Time per request:       14.971 [ms] (mean)
Time per request:       0.060 [ms] (mean, across all concurrent requests)
Transfer rate:          13926.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    6   0.9      6      15
Processing:     1    9   1.8      9      47
Waiting:        1    7   1.7      7      47
Total:          4   15   2.0     15      57

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     15
  75%     15
  80%     16
  90%     17
  95%     18
  98%     21
  99%     22
 100%     57 (longest request)