results/results/raw/interzone/flannel-interzone-apachebench_100K_250_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.6 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.6
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      250
Time taken for tests:   5.456 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      85400000 bytes
HTML transferred:       61200000 bytes
Requests per second:    18328.45 [#/sec] (mean)
Time per request:       13.640 [ms] (mean)
Time per request:       0.055 [ms] (mean, across all concurrent requests)
Transfer rate:          15285.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    6   1.2      6      12
Processing:     2    8   2.3      8      19
Waiting:        1    6   2.0      6      18
Total:          3   14   2.5     14      25

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     15
  80%     16
  90%     17
  95%     18
  98%     19
  99%     20
 100%     25 (longest request)