results/results/raw/interzone/flannel-interzone-apachebench_1M_200_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.2 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.2
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      200
Time taken for tests:   125.412 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      854000000 bytes
HTML transferred:       612000000 bytes
Requests per second:    7973.75 [#/sec] (mean)
Time per request:       25.082 [ms] (mean)
Time per request:       0.125 [ms] (mean, across all concurrent requests)
Transfer rate:          6649.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   6.6      0    1036
Processing:     3   24   2.5     24      52
Waiting:        1   24   2.5     24      52
Total:         10   25   6.9     25    1062

Percentage of the requests served within a certain time (ms)
  50%     25
  66%     25
  75%     25
  80%     26
  90%     27
  95%     29
  98%     32
  99%     34
 100%   1062 (longest request)