results/results/raw/interzone/kuberouter-interzone-apachebench_10M_800_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.2 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.2
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      400
Time taken for tests:   57.882 seconds
Complete requests:      500000
Failed requests:        0
Total transferred:      427000000 bytes
HTML transferred:       306000000 bytes
Requests per second:    8638.19 [#/sec] (mean)
Time per request:       46.306 [ms] (mean)
Time per request:       0.116 [ms] (mean, across all concurrent requests)
Transfer rate:          7204.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  12.0      2    1041
Processing:     0   41   7.9     44      75
Waiting:        0   39   9.2     43      75
Total:          0   46  11.1     46    1082

Percentage of the requests served within a certain time (ms)
  50%     46
  66%     47
  75%     48
  80%     49
  90%     51
  95%     53
  98%     57
  99%     60
 100%   1082 (longest request)