results/results/raw/interzone/weavenet-interzone-apachebench_200K_500_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.5 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.5
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      500
Time taken for tests:   12.747 seconds
Complete requests:      200000
Failed requests:        0
Total transferred:      170800000 bytes
HTML transferred:       122400000 bytes
Requests per second:    15689.69 [#/sec] (mean)
Time per request:       31.868 [ms] (mean)
Time per request:       0.064 [ms] (mean, across all concurrent requests)
Transfer rate:          13084.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   13  33.0     12    1046
Processing:     2   18   4.0     18     221
Waiting:        1   14   3.5     14     216
Total:          4   32  33.3     31    1066

Percentage of the requests served within a certain time (ms)
  50%     31
  66%     32
  75%     33
  80%     34
  90%     36
  95%     38
  98%     39
  99%     40
 100%   1066 (longest request)